###################################################################

# Created by write_sdc on Fri Feb 23 18:23:30 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports iproc_req]
set_load -pin_load 3.40189 [get_ports dproc_req]
set_load -pin_load 3.40189 [get_ports {iaddr[31]}]
set_load -pin_load 3.40189 [get_ports {iaddr[30]}]
set_load -pin_load 3.40189 [get_ports {iaddr[29]}]
set_load -pin_load 3.40189 [get_ports {iaddr[28]}]
set_load -pin_load 3.40189 [get_ports {iaddr[27]}]
set_load -pin_load 3.40189 [get_ports {iaddr[26]}]
set_load -pin_load 3.40189 [get_ports {iaddr[25]}]
set_load -pin_load 3.40189 [get_ports {iaddr[24]}]
set_load -pin_load 3.40189 [get_ports {iaddr[23]}]
set_load -pin_load 3.40189 [get_ports {iaddr[22]}]
set_load -pin_load 3.40189 [get_ports {iaddr[21]}]
set_load -pin_load 3.40189 [get_ports {iaddr[20]}]
set_load -pin_load 3.40189 [get_ports {iaddr[19]}]
set_load -pin_load 3.40189 [get_ports {iaddr[18]}]
set_load -pin_load 3.40189 [get_ports {iaddr[17]}]
set_load -pin_load 3.40189 [get_ports {iaddr[16]}]
set_load -pin_load 3.40189 [get_ports {iaddr[15]}]
set_load -pin_load 3.40189 [get_ports {iaddr[14]}]
set_load -pin_load 3.40189 [get_ports {iaddr[13]}]
set_load -pin_load 3.40189 [get_ports {iaddr[12]}]
set_load -pin_load 3.40189 [get_ports {iaddr[11]}]
set_load -pin_load 3.40189 [get_ports {iaddr[10]}]
set_load -pin_load 3.40189 [get_ports {iaddr[9]}]
set_load -pin_load 3.40189 [get_ports {iaddr[8]}]
set_load -pin_load 3.40189 [get_ports {iaddr[7]}]
set_load -pin_load 3.40189 [get_ports {iaddr[6]}]
set_load -pin_load 3.40189 [get_ports {iaddr[5]}]
set_load -pin_load 3.40189 [get_ports {iaddr[4]}]
set_load -pin_load 3.40189 [get_ports {iaddr[3]}]
set_load -pin_load 3.40189 [get_ports {iaddr[2]}]
set_load -pin_load 3.40189 [get_ports {iaddr[1]}]
set_load -pin_load 3.40189 [get_ports {iaddr[0]}]
set_load -pin_load 3.40189 [get_ports {daddr[31]}]
set_load -pin_load 3.40189 [get_ports {daddr[30]}]
set_load -pin_load 3.40189 [get_ports {daddr[29]}]
set_load -pin_load 3.40189 [get_ports {daddr[28]}]
set_load -pin_load 3.40189 [get_ports {daddr[27]}]
set_load -pin_load 3.40189 [get_ports {daddr[26]}]
set_load -pin_load 3.40189 [get_ports {daddr[25]}]
set_load -pin_load 3.40189 [get_ports {daddr[24]}]
set_load -pin_load 3.40189 [get_ports {daddr[23]}]
set_load -pin_load 3.40189 [get_ports {daddr[22]}]
set_load -pin_load 3.40189 [get_ports {daddr[21]}]
set_load -pin_load 3.40189 [get_ports {daddr[20]}]
set_load -pin_load 3.40189 [get_ports {daddr[19]}]
set_load -pin_load 3.40189 [get_ports {daddr[18]}]
set_load -pin_load 3.40189 [get_ports {daddr[17]}]
set_load -pin_load 3.40189 [get_ports {daddr[16]}]
set_load -pin_load 3.40189 [get_ports {daddr[15]}]
set_load -pin_load 3.40189 [get_ports {daddr[14]}]
set_load -pin_load 3.40189 [get_ports {daddr[13]}]
set_load -pin_load 3.40189 [get_ports {daddr[12]}]
set_load -pin_load 3.40189 [get_ports {daddr[11]}]
set_load -pin_load 3.40189 [get_ports {daddr[10]}]
set_load -pin_load 3.40189 [get_ports {daddr[9]}]
set_load -pin_load 3.40189 [get_ports {daddr[8]}]
set_load -pin_load 3.40189 [get_ports {daddr[7]}]
set_load -pin_load 3.40189 [get_ports {daddr[6]}]
set_load -pin_load 3.40189 [get_ports {daddr[5]}]
set_load -pin_load 3.40189 [get_ports {daddr[4]}]
set_load -pin_load 3.40189 [get_ports {daddr[3]}]
set_load -pin_load 3.40189 [get_ports {daddr[2]}]
set_load -pin_load 3.40189 [get_ports {daddr[1]}]
set_load -pin_load 3.40189 [get_ports {daddr[0]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[31]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[30]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[29]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[28]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[27]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[26]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[25]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[24]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[23]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[22]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[21]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[20]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[19]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[18]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[17]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[16]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[15]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[14]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[13]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[12]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[11]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[10]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[9]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[8]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[7]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[6]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[5]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[4]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[3]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[2]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[1]}]
set_load -pin_load 3.40189 [get_ports {wdata2mem[0]}]
set_load -pin_load 3.40189 [get_ports wenMem]
create_clock [get_ports clk]  -name clk_sys  -period 1.5  -waveform {0 0.75}
set_clock_uncertainty 0.07  [get_clocks clk_sys]
set_input_delay -clock clk_sys  -max 0.5  [get_ports rst]
set_input_delay -clock clk_sys  -max 0.5  [get_ports imem_rdy]
set_input_delay -clock clk_sys  -max 0.5  [get_ports dmem_rdy]
set_input_delay -clock clk_sys  -max 0.5  [get_ports ivalid]
set_input_delay -clock clk_sys  -max 0.5  [get_ports dvalid]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[31]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[30]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[29]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[28]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[27]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[26]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[25]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[24]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[23]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[22]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[21]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[20]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[19]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[18]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[17]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[16]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[15]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[14]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[13]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[12]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[11]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[10]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[9]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[8]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[7]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[6]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[5]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[4]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[3]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[2]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[1]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {idata[0]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[31]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[30]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[29]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[28]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[27]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[26]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[25]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[24]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[23]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[22]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[21]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[20]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[19]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[18]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[17]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[16]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[15]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[14]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[13]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[12]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[11]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[10]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[9]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[8]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[7]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[6]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[5]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[4]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[3]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[2]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[1]}]
set_input_delay -clock clk_sys  -max 0.5  [get_ports {ddata[0]}]
set_output_delay -clock clk_sys  0.5  [get_ports iproc_req]
set_output_delay -clock clk_sys  0.5  [get_ports dproc_req]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[31]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[30]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[29]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[28]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[27]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[26]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[25]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[24]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[23]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[22]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[21]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[20]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[19]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[18]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[17]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[16]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[15]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[14]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[13]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[12]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[11]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[10]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[9]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[8]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[7]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[6]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[5]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[4]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[3]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[2]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[1]}]
set_output_delay -clock clk_sys  0.5  [get_ports {iaddr[0]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[31]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[30]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[29]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[28]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[27]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[26]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[25]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[24]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[23]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[22]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[21]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[20]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[19]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[18]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[17]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[16]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[15]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[14]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[13]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[12]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[11]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[10]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[9]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[8]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[7]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[6]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[5]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[4]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[3]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[2]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[1]}]
set_output_delay -clock clk_sys  0.5  [get_ports {daddr[0]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[31]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[30]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[29]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[28]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[27]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[26]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[25]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[24]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[23]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[22]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[21]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[20]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[19]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[18]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[17]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[16]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[15]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[14]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[13]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[12]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[11]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[10]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[9]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[8]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[7]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[6]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[5]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[4]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[3]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[2]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[1]}]
set_output_delay -clock clk_sys  0.5  [get_ports {wdata2mem[0]}]
set_output_delay -clock clk_sys  0.5  [get_ports wenMem]
